Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: All the techniques allowing reducing the memory usage and provide faster startup times are not only advantageous in containers. Even on bare metal, it would reduce your memory pressure, and it’s always pleasant to not have to wait 10 seconds to see your application running.
ja_jp: メモリー使用量を削減し、起動時間を短縮するためのすべての技術は、コンテナーだけでなく、ベアメタルでも有利です。ベアメタルであってもメモリー負荷を軽減でき、アプリケーションの実行を 10 秒も待つ必要がないのは常に快適です。

source: All the test profile configuration is stored in a single class, which makes it easy to tell if the previous test ran with the same configuration.
ja_jp: テストプロファイルの設定はすべて単一のクラスに保存されているので、前回のテストが同じ設定で実行されたかどうかが簡単にわかります。

source: All these delivery mechanism are non-blocking, and are providing one of the fundamental brick to build reactive applications.
ja_jp: これらの配信メカニズムはすべてノンブロッキングであり、リアクティブアプリケーションを構築するための基本的なブロックの1つを提供しています。

source: All these delivery mechanisms are non-blocking and are providing one of the fundamental bricks to build reactive applications.
ja_jp: これらの配信メカニズムはすべてノンブロッキングであり、リアクティブなアプリケーションを構築するための基本的な要素の一つとなっています。

source: All these delivery mechanisms are non-blocking, and are providing one of the fundamental brick to build reactive applications.
ja_jp: これらの配信メカニズムはすべてノンブロッキングであり、リアクティブアプリケーションを構築するための基本的な要素の1つを提供しています。

source: All these methods have default implementations so just override the ones you need to override.
ja_jp: これらのメソッドにはすべてデフォルトの実装があるため、オーバーライドが必要なメソッドのみオーバーライドします。

source: All these options can be easily implemented with the custom `TenantResolver` and `TenantConfigResolver` implementations for the OIDC `service` applications.
ja_jp: これらのオプションはすべて、OIDC `service` アプリケーションのカスタムの `TenantResolver` 実装や `TenantConfigResolver` 実装を使用して簡単に実装できます。

source: All this functionality is part of the Quarkus `deployment` modules, so does not affect the production application in any way. If you want to disable all Dev Services you can use the `quarkus.devservices.enabled=false` config property, although in most cases this is not necessary as simply configuring the service will result in the Dev Service being disabled automatically.
ja_jp: この機能はすべて、Quarkus `deployment` モジュールの一部であり、本番アプリケーションには一切影響しません。すべてのDev Servicesを無効にしたい場合は、 `quarkus.devservices.enabled=false` 設定プロパティを使用できますが、ほとんどの場合、サービスを構成するだけでDev Servicesが自動的に無効になるため、この設定は必要ありません。

source: All this, using your chosen build tool (Maven, Gradle or also Gradle with Kotlin DSL) and your chosen language (Java, Kotlin or Scala).
ja_jp: これらはすべて、選択したビルドツール(Maven、Gradle、またはKotlin DSLによるGradle)と選択した言語(Java、Kotlin、またはScala)を使用して行うことが出来ます。

source: All three approaches need to be aware of the port that Heroku assigns to it to handle traffic. Luckily, there's a dynamic configuration property for it.
ja_jp: この 3 つのアプローチはいずれも、トラフィックを処理するために Heroku が割り当てるポートを意識する必要があります。 幸運なことに、そのための動的な設定プロパティーがあります。

source: All translation files must be placed under:
ja_jp: すべての翻訳ファイルは以下に配置する必要があります。

source: All translation keys must therefore start with:
ja_jp: したがって、すべての翻訳キーは次の文字列で始まる必要があります。

source: All under one framework.
ja_jp: すべてを一つの枠組みの下で。

source: All was well... until we started deploying multiple tenants at the same time, and/or different applications. We had sized the _ocpdeploy_ container to `200 millicores` and `280 Mb` of RAM. For some applications there were around 30 tenants, that would be all deployed in parallel. This meant 30 pods, which accounted for `6 cores` and `8 Gb` of RAM. This seems livable, but deployments tend to be done after business hours, between 7 and 8pm for many. And we started being afraid of the impact _ocpdeploy_ itself would have if we were running multiple deployments in parallel, on top of our SpringBoot or WildFly applications, which take their toll on the cluster at startup.
ja_jp: 全てが順調だったのは、複数のテナントを同時にデプロイしたり、異なるアプリケーションをデプロイするようになるまでです。 _ocpdeploy_コンテナのサイズは `200 millicores` 、RAMは `280 Mb` でした。いくつかのアプリケーションでは、約30のテナントがあり、それらはすべて並行してデプロイされます。これは30ポッドを意味し、 `6 cores` と `8 Gb` のRAMを占めていました。しかし、デプロイは多くの場合、営業時間後の午後7時から8時の間に行われることが多いのです。また、起動時にクラスタに負担をかけるSpringBootやWildFlyのアプリケーションに加えて、複数のデプロイを並行して実行する場合、 _ocpdeploy_自体が受ける影響を心配し始めました。

source: All we need to do is add `quarkus-undertow` as a dependency to our `./greeting-extension/runtime/pom.xml`:
ja_jp: 必要なことは、`quarkus-undertow` を `./greeting-extension/runtime/pom.xml` への依存関係として追加することだけです。

source: All we need to do is add `quarkus-undertow` as dependency to our `./greeting-extension/runtime/pom.xml`:
ja_jp: 必要なのは、 `quarkus-undertow` を依存関係として `./greeting-extension/runtime/pom.xml` に追加することだけです。

source: All we need to specify is the `smallrye-rabbitmq` connector. By default, reactive messaging maps the channel name `quote-requests` to the same RabbitMQ exchange name.
ja_jp: 指定する必要があるのは、 `smallrye-rabbitmq` のコネクタだけです。デフォルトでは、リアクティブ・メッセージングは、チャネル名 `quote-requests` を同じ RabbitMQ のエクスチェンジ名にマッピングします。

source: All xref:request-parameters[Request Parameters] can be declared as link:{jdkapi}/java/lang/String.html[`String`], but also any of the following types:
ja_jp: すべての xref:request-parameters[リクエストパラメーター] は、link:{jdkapi}/java/lang/String.html[String] として宣言することができますが、それ以外にも以下のいずれかの型でも大丈夫です:

source: Allocated from the JVM heap (`byte[]`).
ja_jp: JVMヒープ (`byte[]`) から割り当てられます。

source: Allocated outside the JVM heap using `ByteBuffer.allocateDirect()`.
ja_jp: `ByteBuffer.allocateDirect()` を使用して JVM ヒープ外に割り当てられます。

source: Allocation benefit: heavy objects are only allocated once per thread, but because the number of these threads was intended to be limited, it would not use too much memory.
ja_jp: 割り当ての利点: 重いオブジェクトはスレッドごとに 1 回だけ割り当てられますが、これらのスレッドの数は制限されることが意図されているため、メモリーがあまり使用されません。

source: Allow JWT introspection
ja_jp: JWT イントロスペクションを許可する

source: Allow UserInfo cache
ja_jp: UserInfo キャッシュを許可する

source: Allow caching UserInfo in the internal ID token
ja_jp: 内部 ID トークンでの UserInfo キャッシュを許可する

source: Allow passing unsupported properties to Hibernate ORM
ja_jp: Hibernate ORMにサポートされていないプロパティを渡せるように

source: Allow refreshing token
ja_jp: トークンのリフレッシュを許可するかどうか

source: Allow root certificates to be configured at run time of native image https://github.com/oracle/graal/pull/3091[#3091] (_teshull_ assigned by Christian Wimmer at Oracle to work on this for the GraalVM 21.3 release)
ja_jp: ネイティブイメージの実行時にルート証明書を設定できるようにしました link:https://github.com/oracle/graal/pull/3091[#3091] (_teshull_はオラクルの Christian Wimmer から GraalVM 21.3 リリースのための作業を任されました)

source: Allow to provide custom configuration for JAXB context
ja_jp: JAXBコンテキストのカスタム設定を提供できるように

source: Allow token introspection cache
ja_jp: トークンイントロスペクションキャッシュを許可する

source: Allowed values: `cluster-ip`, `node-port`, `load-balancer`, `external-name`
ja_jp: 許可される値: `cluster-ip` , `node-port` , `load-balancer` . `external-name`

source: Allowing all origins in dev mode
ja_jp: 開発モードでの全オリジンの許可

source: Allowing unrestricted origins with `quarkus.http.cors.origins=*` in production environments poses severe security risks, such as unauthorized data access or resource abuse. For production, define explicit origins in the `quarkus.http.cors.origins` property.
ja_jp: 本番環境で `quarkus.http.cors.origins=*` を使用して無制限のオリジンを許可すると、不正なデータアクセスやリソースの悪用など、重大なセキュリティーリスクが生じます。 本番環境では、`quarkus.http.cors.origins` プロパティーで明示的なオリジンを定義してください。

source: Allows cookies or credentials in cross-origin requests.
ja_jp: クロスオリジンリクエストで Cookie または認証情報を許可します。

source: Allows us to add users while hashing passwords with the proper bcrypt hash.
ja_jp: 適切な bcrypt ハッシュを使用してパスワードをハッシュ化して、ユーザーを追加できます。

source: Almost ready! To initialize the DB in development mode, we will use the client simple `query` method. It returns a `Uni` and thus can be composed to execute queries sequentially:
ja_jp: ほとんど準備ができています! 開発モードで DB を初期化するには、クライアントの単純な `query` メソッドを使用します。 `Uni` を返すため、クエリーを順番に実行するように設定できます。

source: Along with other OpenAPI Header fields that can be set via configuration properties (as discussed in link:/blog/openapi-for-everyone/[this post]):
ja_jp: 設定プロパティーを介して設定できる他の OpenAPI Header フィールドと一緒に( /blog/openapi-for-everyone/[この記事]で説明しています)。

source: Alongside Quarkus, interacting with web frameworks such as React and Angular is a natural need. Many users have been requesting a smooth integration since the early stages of Quarkus (https://github.com/quarkusio/quarkus/issues/588[#588]). This is why I created the Quinoa extension for Quarkus.
ja_jp: Quarkusと共に、ReactやAngularといったWebフレームワークとの連携は、自然なニーズです。多くのユーザーは、Quarkusの初期段階から、スムーズな統合を要望していました ( link:https://github.com/quarkusio/quarkus/issues/588[#588] ）。そのため、Quarkus用のQuinoaエクステンションを作成しました。

source: Alongside support for Java completion and validation, the extension also supports type hovering for built-in and user-defined Java classes.
ja_jp: Java補完と検証のサポートに加え、組み込みおよびユーザー定義のJavaクラスに対するタイプホバーリングもサポートしています。

source: Alpha and beta are computed by multiplying the configurable constants with a base 10 logarithm of the current limit.
ja_jp: アルファとベータは、設定可能な定数を現在の制限の底が 10 の対数 (10 進対数) と掛け合わせることで計算されます。

source: Alright. Add all sources and create a first commit. You can choose your own conventions for commit messages however you can get more bang for your buck when using JReleaser if you follow the link:https://www.conventionalcommits.org/en/v1.0.0/[Conventional Commits] specification. Make your first commit with the following message "build: Add initial sources".
ja_jp: さてさて。すべてのソースを追加し、最初のコミットを作成します。コミットメッセージの規約は自由ですが、 link:https://www.conventionalcommits.org/en/v1.0.0/[Conventional Commits] 仕様に従った方が、JReleaserをより効果的に使うことができます。最初のコミットでは、"build:Add initial sources" というメッセージで最初のコミットを行います。

source: Also Maven 3.8.2 is the minimal requirement for Quarkus 3 projects.
ja_jp: また、Maven 3.8.2は、Quarkus 3プロジェクトの最小要件となっています。

source: Also a big thanks to all the contributors providing pull requests, be they for the code or the documentation!
ja_jp: また、コードであれドキュメントであれ、プルリクエストを提供してくれたすべての貢献者にも感謝しています。

source: Also add this dependency to your project:
ja_jp: 次の依存関係もプロジェクトに追加します。

source: Also create `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/WeatherStationData.java`, which represents the actual aggregation result for a weather station:
ja_jp: また、気象台の実際の集計結果を表す `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/WeatherStationData.java` を作成します。

source: Also create the method's return type in the file `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/GetWeatherStationDataResult.java`:
ja_jp: また、メソッドの戻り値の型もファイル `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/GetWeatherStationDataResult.java` に作成します:

source: Also disable the token verification in the filter:
ja_jp: また、フィルターのトークン検証を無効にします:

source: Also for command mode applications the dev mode is supported. When you start your application in dev mode, the command mode application is executed:
ja_jp: また、コマンドモードのアプリケーションでは、devモードもサポートされています。 devモードでアプリケーションを起動すると、コマンドモードのアプリケーションが実行されます：

source: Also make sure to wrap methods that modify the database or involve multiple queries (e.g. `entity.persist()`) within a transaction. You can annotate a CDI business method that returns `Uni` with the `@WithTransaction` annotation. The method will be intercepted and the returned `Uni` is triggered within a transaction boundary. Alternatively, you can use the `Panache.withTransaction()` method for the same effect.
ja_jp: また、データベースを変更するメソッドや複数のクエリー (例: `entity.persist()`) を伴うメソッドをトランザクション内でラップしてください。 `Uni` を返す CDI ビジネスメソッドに `@WithTransaction` アノテーションを付けることができます。 メソッドはインターセプトされ、返された `Uni` はトランザクション境界内でトリガーされます。 または、 `Panache.withTransaction()` メソッドを使用して同じ効果を得ることもできます。

source: Also make sure to wrap methods that modify the database or involve multiple queries (e.g. `entity.persist()`) within a transaction. You can annotate a CDI business method that returns `Uni` with the `@WithTransaction` annotation. The method will be intercepted and the returned `Uni` is triggered within a transaction boundary. If you have multiple persistence units, you can specify which one to use by providing the persistence unit name as the annotation value: `@WithTransaction("my-persistence-unit")`. If not specified, the default persistence unit is used. Alternatively, you can use the `Panache.withTransaction()` method for the same effect.
ja_jp: また、データベースを変更したり、複数のクエリ (例: `entity.persist()`) を伴うメソッドをトランザクション内でラップするようにしてください。`Uni` を返す CDI ビジネスメソッドに `@WithTransaction` アノテーションを付けることができます。メソッドはインターセプトされ、返された `Uni` はトランザクション境界内でトリガーされます。複数の永続化ユニットを使用している場合は、アノテーション値として永続化ユニット名 `@WithTransaction("my-persistence-unit")` を指定することで、どのユニットを使用するかを指定できます。指定しない場合、デフォルトの永続化ユニットが使用されます。あるいは、`Panache.withTransaction()` メソッドを使用して同じ効果を得ることもできます。

source: Also note that `@ServerExceptionMapper` can be used to handle exceptions in a global manner, just as JAX-RS does with `ExceptionMapper`. To do that, simply annotate a method that does not belong to a Resource class with `@ServerExceptionMapper`.
ja_jp: また、 `@ServerExceptionMapper`は、JAX-RSが `ExceptionMapper` を使うのと同じように、グローバルな方法で例外を扱うことができることにも注意する必要があります。 そのためには、Resourceクラスに属さないメソッドに `@ServerExceptionMapper` をアノテーションするだけで大丈夫です。

source: Also note that the `stream` method will complete before the `Multi` completes.
ja_jp: また、 `stream` メソッドは `Multi` が完了する前に完了することに注意してください。

source: Also note that this list only includes the technical features of your extension. You might also want to think about how you share your extension, and how it presents itself to the world. The link:https://hub.quarkiverse.io/checklistfornewprojects/[new extension checklist] on the Quarkiverse Hub has a useful list of ways extensions can participate in the ecosystem. It's also a good idea to spend some time on the metadata in the xref:extension-metadata.adoc#quarkus-extension-yaml[`quarkus-extension.yaml` file], which is used by Quarkus tooling.
ja_jp: また、このリストにはエクステンションの技術的な機能のみが含まれていることに注意してください。 また、エクステンションをどのように共有するか、そしてエクステンションをどのように提示するかについても検討する必要があります。 Quarkiverse Hub の link:https://hub.quarkiverse.io/checklistfornewprojects/[新しいエクステンションのチェックリスト] には、エクステンションがエコシステムに参加できる便利な方法のリストがあります。 また、Quarkus ツールで使用される xref:extension-metadata.adoc#quarkus-extension-yaml[`quarkus-extension.yaml` ファイル] のメタデータに時間を費やすことも適切です。

source: Also on Quarkiverse, the https://docs.quarkiverse.io/quarkus-amazon-services/dev/opentelemetry.html[Quarkus AWS SDK has integration with OpenTelemetry].
ja_jp: Quarkiverse では、 https://docs.quarkiverse.io/quarkus-amazon-services/dev/opentelemetry.html[Quarkus AWS SDK が OpenTelemetry に統合されています]。

source: Also secured by RBAC, this endpoint is accessible only to users with the `user` role. It returns the caller's username as a string.
ja_jp: このエンドポイントも RBAC によって保護されており、 `user` ロールを持つユーザーのみがアクセスできます。 呼び出し元のユーザー名を文字列として返します。

source: Also see the xref:security-oidc-configuration-properties-reference.adoc[OIDC configuration properties] reference guide.
ja_jp: また、 xref:security-oidc-configuration-properties-reference.adoc[OIDC設定プロパティ] のリファレンスガイドもご参照ください。

source: Also see xref:openapi-swaggerui.adoc[the OpenAPI Guide]
ja_jp: xref:openapi-swaggerui.adoc[OpenAPI ガイド] も参照してください。

source: Also see xref:openapi-swaggerui.adoc[the OpenAPI Guide].
ja_jp: xref:openapi-swaggerui.adoc[OpenAPI ガイド] も参照してください。

source: Also see xref:security-openid-connect-client.adoc[OpenID Connect client and token propagation quickstart].
ja_jp: xref:security-openid-connect-client.adoc[OpenID Connect Clientとトークン伝搬クイックスタート] も参照してください。

source: Also specify the following settings in your Quarkus `application.properties`:
ja_jp: また、以下の設定をQuarkusの `application.properties` で指定します:

source: Also the Keycloak page offers an option to `Sign In To Keycloak To Configure Realms` using a `Keycloak Admin` option in the right top corner:
ja_jp: また、Keycloak ページには、右上隅にある `KeycloakAdmin` オプションを使用して、Keycloak にサインインしてレルムを設定 (`SignIn To Keycloak To Configure Realms`) するオプションがあります。

source: Also the return type for `getMetaData()` must be defined (`aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/PipelineMetadata.java`):
ja_jp: また、 `getMetaData()` のリターンタイプも定義しなければなりません ( `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/PipelineMetadata.java` )。

source: Also to be noted that currently parentheses are not supported and expressions are evaluated from left to right when needed.
ja_jp: また、現在、括弧はサポートされておらず、式は必要に応じて左から右に評価されることに注意してください。

source: Also update the `applications.properties` file:
ja_jp: `applications.properties` ファイルも更新します。

source: Also we centralized all the information about Dev Services in link:/guides/dev-services[one place].
ja_jp: また、Dev Servicesに関する情報を link:/guides/dev-services[一箇所]にまとめました。

source: Also, OAuth2 servers may not support a well-known configuration endpoint in which case the discovery has to be disabled and the authorization, token, and introspection and/or userinfo endpoint paths have to be configured manually.
ja_jp: また、OAuth2 サーバーは、よく知られた設定エンドポイントをサポートしていない場合があります。その場合は、検出を無効にして、認証、トークン、イントロスペクション、および/またはユーザー情報のエンドポイントパスを手動で設定する必要があります。

source: Also, Quarkus does not support distributed transactions. This means that models that propagate transaction context, such as link:https://download.oracle.com/otndocs/jcp/7309-jts-1.0-spec-oth-JSpec/[Java Transaction Service] (JTS), REST-AT, WS-Atomic Transaction, and others, are not supported by the `narayana-jta` extension.
ja_jp: また、Quarkusは分散トランザクションをサポートしていません。 つまり、 link:https://download.oracle.com/otndocs/jcp/7309-jts-1.0-spec-oth-JSpec/[Java Transaction Service] （JTS）、REST-AT、WS-Atomic Transactionなど、トランザクションコンテキストを伝播するモデルは、 `narayana-jta` エクステンションではサポートされません。

source: Also, Quarkus makes it very easy to configure various Jackson settings via CDI beans. The simplest (and suggested) approach is to define a CDI bean of type `io.quarkus.jackson.ObjectMapperCustomizer` inside of which any Jackson configuration can be applied.
ja_jp: また、Quarkusは、CDI Bean を介して、様々なJackson設定を非常に簡単に設定することができます。最も単純な(そして推奨される)アプローチは、 `io.quarkus.jackson.ObjectMapperCustomizer` 型の CDI Bean を定義し、その中で、Jackson の設定を適用することです。

source: Also, Quarkus will set many Hibernate ORM configuration settings automatically, and will often use more modern defaults.
ja_jp: また、Quarkusは多くのHibernate ORMの設定を自動的に設定し、多くの場合、より現代的なデフォルト値を使用します。

source: Also, Quarkus will set many Hibernate Reactive configuration settings automatically, and will often use more modern defaults.
ja_jp: また、Quarkusは多くのHibernate Reactiveの設定を自動的に行い、より現代的なデフォルトを使用することが多いです。

source: Also, RESTEasy Classic is not going anywhere: you can still use it and create new projects with it, but it is not imported by default.
ja_jp: また、RESTEasy Classicはどこにも行きません。RESTEasy Classicを使用して新しいプロジェクトを作成することは可能ですが、デフォルトではインポートされません。

source: Also, add `OidcClientCreator` to create an OIDC client programmatically at startup. `OidcClientCreator` supports `RestClientWithTokenHeaderParam` REST client calls:
ja_jp: また、起動時にプログラムで OIDC クライアントを作成する `OidcClientCreator` を追加します。 `OidcClientCreator` は、 `RestClientWithTokenHeaderParam` REST クライアント呼び出しをサポートします。

source: Also, at least in the generated Maven archetype `pom.xml`, the `quarkus-rest`, `quarkus-reactive-routes`, and `quarkus-undertow` dependencies are all optional. Pick which HTTP framework(s) you want to use (Jakarta REST, Reactive Routes, and/or Servlet) and remove the other dependencies to shrink your deployment.
ja_jp: また、少なくとも生成された Maven アーキタイプ `pom.xml` では、 `quarkus-rest`、 `quarkus-reactive-routes`、 `quarkus-undertow` 依存関係はすべてオプションです。使用する HTTP フレームワーク (Jakarta REST、Reactive Routes、Servlet) を選択し、 デプロイメントを縮小するには、他の依存関係を削除します。

source: Also, at least in the generated Maven archetype `pom.xml`, the `quarkus-resteasy-reactive`, `quarkus-reactive-routes`, and `quarkus-undertow` dependencies are all optional. Pick which HTTP framework(s) you want to use (JAX-RS, Reactive Routes, and/or Servlet) and remove the other dependencies to shrink your deployment.
ja_jp: また、少なくとも生成された Maven アーキタイプ `pom.xml` では、 `quarkus-resteasy-reactive`、 `quarkus-reactive-routes`、および `quarkus-undertow` の依存関係はすべて任意です。使用する HTTP フレームワーク (JAX-RS、Reactive Routes、Servlet) を選択し、他の依存関係を削除してデプロイメントを縮小します。

source: Also, at least in the generated Maven archetype `pom.xml`, the `quarkus-resteasy-reactive`, `quarkus-reactive-routes`, and `quarkus-undertow` dependencies are all optional. Pick which HTTP framework(s) you want to use (Jakarta REST, Reactive Routes, and/or Servlet) and remove the other dependencies to shrink your deployment.
ja_jp: また、少なくとも生成されたMaven archetype `pom.xml` では、 `quarkus-resteasy-reactive` 、 `quarkus-reactive-routes` 、 `quarkus-undertow` の依存関係はすべてオプションになっています。使用したいHTTPフレームワーク（jakarta REST、Reactive Routes、Servlet）を選択し、他の依存関係を削除してデプロイを縮小してください。

source: Also, at least in the generated Maven archetype `pom.xml`, the `quarkus-resteasy`, `quarkus-reactive-routes`, and `quarkus-undertow` dependencies are all optional. Pick which HTTP framework(s) you want to use (JAX-RS, Reactive Routes, and/or Servlet) and remove the other dependencies to shrink your deployment.
ja_jp: また、少なくとも生成されたMavenアーキタイプ `pom.xml` および、 `quarkus-resteasy` 、 `quarkus-reactive-routes` 、 `quarkus-undertow` の依存関係はすべてオプションです。 使用したいHTTPフレームワーク（JAX-RS、Reactive Routes、および/またはServlet）を選択し、デプロイメントを縮小するために他の依存関係を削除します。

source: Also, enabling OpenTelemetry for JDBC is now as simple as setting `quarkus.datasource.jdbc.telemetry` to `true`. You don't have to modify your JDBC connection URL anymore.
ja_jp: また、JDBCのOpenTelemetryを有効にするには、 `quarkus.datasource.jdbc.telemetry` を `true` に設定するだけでよくなりました。もうJDBC接続URLを変更する必要はありません。

source: Also, for command mode applications, the dev mode is supported. When you start your application in dev mode, the command mode application is executed:
ja_jp: また、コマンドモードのアプリケーションについては、開発モードがサポートされています。 開発モードでアプリケーションを起動すると、コマンドモードアプリケーションが実行されます:

source: Also, in case the interface is in a third-party jar, you can do it by using an empty class that will host the `@RegisterForProxy` for it.
ja_jp: また、インターフェイスがサードパーティーの jar 内にある場合は、`@RegisterForProxy` をホストする空のクラスを使用して実行できます。

source: Also, in multi-hop deployments, the credentials can be exposed if HTTPS is used between the client and the first Quarkus endpoint only, and the credentials are propagated to the next Quarkus endpoint over HTTP.
ja_jp: また、マルチホップデプロイメントでは、クライアントと最初のQuarkusエンドポイント間のみでHTTPSを使用し、次のQuarkusエンドポイントにHTTPで認証情報を伝達する場合、認証情報が漏洩する可能性があります。

source: Also, in the <<vertx-oidc-vertx>> section, we also commented that GitHub access tokens are meant to be used to access GitHub API, and not the application that acquired them, and therefore enforcing a GitHub access token `user:email` scope was not necessary.
ja_jp: また、 <<vertx-oidc-vertx>> セクションでは、GitHub アクセストークンは GitHub API へのアクセスに使用するためのものであり、それを取得したアプリケーションへのアクセスに使用するためのものではないため、GitHub アクセストークンの `user:email` スコープを強制する必要はないとも述べました。

source: Also, make sure your Heroku CLI is working:
ja_jp: また、Heroku CLI が動作していることを確認してください。

source: Also, not every step will apply to every extension. For example, you don't need a Dev Service if your extension doesn't depend on external services.
ja_jp: また、すべての手順がすべてのエクステンションに適用されるわけではありません。たとえば、エクステンションが外部サービスに依存していない場合は、Dev Service は必要ありません。

source: Also, see the Notification controller below as an alternative.
ja_jp: あるいは、以下の Notification コントローラーを参照してください。

source: Also, see the xref:security-oidc-configuration-properties-reference.adoc[OpenID Connect (OIDC) configuration properties] reference guide.
ja_jp: また、xref:security-oidc-configuration-properties-reference.adoc[OpenID Connect (OIDC) 設定プロパティー] のリファレンスガイドも参照してください。

source: Also, since configuring origins during development can be challenging, consider allowing all origins in development mode:
ja_jp: また、開発中にオリジンを設定するのは困難な場合があるため、開発モードですべてのオリジンを許可することを検討してください。
